
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>集群模式 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="rong-qi-kai-ji-zi-dong-qi-dong/dockerfile.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    First Chapter
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="zhi-ding-yong-hu-zhi-xing-rong-qi.html">
            
                <a href="zhi-ding-yong-hu-zhi-xing-rong-qi.html">
            
                    
                    指定用户执行容器命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="image.html">
            
                <a href="image.html">
            
                    
                    镜像
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="mount.html">
            
                <a href="mount.html">
            
                    
                    数据管理
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="bind.html">
            
                <a href="bind.html">
            
                    
                    绑定
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="volumes.html">
            
                <a href="volumes.html">
            
                    
                    卷
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="tmpfs.html">
            
                <a href="tmpfs.html">
            
                    
                    tmpfs
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="registry.html">
            
                <a href="registry.html">
            
                    
                    私有仓库
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="rong-qi-kai-ji-zi-dong-qi-dong.html">
            
                <a href="rong-qi-kai-ji-zi-dong-qi-dong.html">
            
                    
                    容器配置
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" data-path="restat.html">
            
                <a href="restat.html">
            
                    
                    重启策略
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.2" data-path="stats.html">
            
                <a href="stats.html">
            
                    
                    运行指标
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.3" data-path="resource.html">
            
                <a href="resource.html">
            
                    
                    配置系统资源
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.4" data-path="log.html">
            
                <a href="log.html">
            
                    
                    日志
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.5" data-path="rong-qi-kai-ji-zi-dong-qi-dong/docker-run.html">
            
                <a href="rong-qi-kai-ji-zi-dong-qi-dong/docker-run.html">
            
                    
                    docker run
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.6" data-path="rong-qi-kai-ji-zi-dong-qi-dong/docker-stop.html">
            
                <a href="rong-qi-kai-ji-zi-dong-qi-dong/docker-stop.html">
            
                    
                    docker stop
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.7" data-path="rong-qi-kai-ji-zi-dong-qi-dong/docker-start.html">
            
                <a href="rong-qi-kai-ji-zi-dong-qi-dong/docker-start.html">
            
                    
                    docker start/restart
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.8" data-path="rong-qi-kai-ji-zi-dong-qi-dong/rong-qi-zi-dong-qi-dong-she-zhi.html">
            
                <a href="rong-qi-kai-ji-zi-dong-qi-dong/rong-qi-zi-dong-qi-dong-she-zhi.html">
            
                    
                    docker update
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.9" data-path="rong-qi-kai-ji-zi-dong-qi-dong/gua-zai-mu-lu.html">
            
                <a href="rong-qi-kai-ji-zi-dong-qi-dong/gua-zai-mu-lu.html">
            
                    
                    挂载目录
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.10" data-path="rong-qi-kai-ji-zi-dong-qi-dong/bei-fen-hui-fu-he-qian-yi.html">
            
                <a href="rong-qi-kai-ji-zi-dong-qi-dong/bei-fen-hui-fu-he-qian-yi.html">
            
                    
                    备份恢复和迁移
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.11" data-path="rong-qi-kai-ji-zi-dong-qi-dong/dockerfile.html">
            
                <a href="rong-qi-kai-ji-zi-dong-qi-dong/dockerfile.html">
            
                    
                    dockerfile
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.8" data-path="swarm.html">
            
                <a href="swarm.html">
            
                    
                    集群模式
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >集群模式</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h6 id="&#x96C6;&#x7FA4;&#x6A21;&#x5F0F;">&#x96C6;&#x7FA4;&#x6A21;&#x5F0F;</h6>
<blockquote>
<p>&#x4E00;&#x4E2A;&#x7FA4;&#x96C6;&#x7531;&#x591A;&#x4E2A;Docker&#x4E3B;&#x673A;&#x7EC4;&#x6210;&#xFF0C;&#x8FD9;&#x4E9B;Docker&#x4E3B;&#x673A;&#x4EE5;&#x7FA4;&#x96C6;&#x6A21;&#x5F0F;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x5145;&#x5F53;&#x7BA1;&#x7406;&#x8005;&#xFF08;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x6210;&#x5458;&#x8D44;&#x683C;&#x548C;&#x59D4;&#x6D3E;&#xFF09;&#x548C;&#x5DE5;&#x4F5C;&#x4EBA;&#x5458;&#xFF08;&#x8FD0;&#x884C; &#x7FA4;&#x96C6;&#x670D;&#x52A1;&#xFF09;,&#x7ED9;&#x5B9A;&#x7684;Docker&#x4E3B;&#x673A;&#x53EF;&#x4EE5;&#x662F;&#x7ECF;&#x7406;&#xFF0C;&#x5DE5;&#x4F5C;&#x4EBA;&#x5458;&#x6216;&#x540C;&#x65F6;&#x62C5;&#x4EFB;&#x8FD9;&#x4E24;&#x4E2A;&#x89D2;&#x8272;,&#x5982;&#x679C;&#x5DE5;&#x4F5C;&#x8282;&#x70B9;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x5219;Docker&#x4F1A;&#x5728;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x4E0A;&#x8C03;&#x5EA6;&#x8BE5;&#x8282;&#x70B9;&#x7684;&#x4EFB;&#x52A1;</p>
</blockquote>
<ul>
<li>&#x4E0E;Docker Engine&#x96C6;&#x6210;&#x7684;&#x96C6;&#x7FA4;&#x7BA1;&#x7406;&#xFF1A;&#x4F7F;&#x7528;Docker Engine CLI&#x521B;&#x5EFA;&#x5927;&#x91CF;Docker Engine&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x4E2D;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x670D;&#x52A1;&#x3002;&#x60A8;&#x4E0D;&#x9700;&#x8981;&#x5176;&#x4ED6;&#x7F16;&#x6392;&#x8F6F;&#x4EF6;&#x5373;&#x53EF;&#x521B;&#x5EFA;&#x6216;&#x7BA1;&#x7406;&#x7FA4;&#x4F53;&#x3002;</li>
<li>&#x5206;&#x6563;&#x5F0F;&#x8BBE;&#x8BA1;&#xFF1A; Docker Engine&#x65E0;&#x9700;&#x5728;&#x90E8;&#x7F72;&#x65F6;&#x5904;&#x7406;&#x8282;&#x70B9;&#x89D2;&#x8272;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x800C;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x5904;&#x7406;&#x4EFB;&#x4F55;&#x4E13;&#x4E1A;&#x5316;&#x95EE;&#x9898;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Docker Engine&#x90E8;&#x7F72;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x5305;&#x62EC;&#x7BA1;&#x7406;&#x8005;&#x548C;&#x5DE5;&#x4F5C;&#x8005;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x60A8;&#x53EF;&#x4EE5;&#x4ECE;&#x5355;&#x4E2A;&#x78C1;&#x76D8;&#x6620;&#x50CF;&#x6784;&#x5EFA;&#x6574;&#x4E2A;&#x7FA4;&#x96C6;&#x3002;</li>
<li>&#x58F0;&#x660E;&#x5F0F;&#x670D;&#x52A1;&#x6A21;&#x578B;&#xFF1A; Docker Engine&#x4F7F;&#x7528;&#x58F0;&#x660E;&#x5F0F;&#x65B9;&#x6CD5;&#x6765;&#x5B9A;&#x4E49;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5806;&#x6808;&#x4E2D;&#x5404;&#x79CD;&#x670D;&#x52A1;&#x7684;&#x6240;&#x9700;&#x72B6;&#x6001;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x4E2A;&#x5305;&#x542B;Web&#x524D;&#x7AEF;&#x670D;&#x52A1;&#x548C;&#x6D88;&#x606F;&#x961F;&#x5217;&#x670D;&#x52A1;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x5E93;&#x540E;&#x7AEF;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</li>
<li>&#x7F29;&#x653E;&#x6BD4;&#x4F8B;&#xFF1A;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x58F0;&#x660E;&#x8981;&#x8FD0;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x6570;&#x3002;&#x5F53;&#x60A8;&#x653E;&#x5927;&#x6216;&#x7F29;&#x5C0F;&#x65F6;&#xFF0C;&#x7FA4;&#x7BA1;&#x7406;&#x5668;&#x4F1A;&#x901A;&#x8FC7;&#x6DFB;&#x52A0;&#x6216;&#x5220;&#x9664;&#x4EFB;&#x52A1;&#x6765;&#x81EA;&#x52A8;&#x8C03;&#x6574;&#x4EE5;&#x7EF4;&#x6301;&#x6240;&#x9700;&#x7684;&#x72B6;&#x6001;&#x3002;</li>
<li>&#x6240;&#x9700;&#x72B6;&#x6001;&#x534F;&#x8C03;&#xFF1A;&#x7FA4;&#x96C6;&#x7BA1;&#x7406;&#x5668;&#x8282;&#x70B9;&#x4E0D;&#x65AD;&#x76D1;&#x89C6;&#x96C6;&#x7FA4;&#x72B6;&#x6001;&#xFF0C;&#x5E76;&#x534F;&#x8C03;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#x4E0E;&#x60A8;&#x8868;&#x793A;&#x7684;&#x6240;&#x9700;&#x72B6;&#x6001;&#x4E4B;&#x95F4;&#x7684;&#x4EFB;&#x4F55;&#x5DEE;&#x5F02;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x5C06;&#x670D;&#x52A1;&#x8BBE;&#x7F6E;&#x4E3A;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x7684;10&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x800C;&#x627F;&#x8F7D;&#x5176;&#x4E2D;&#x4E24;&#x4E2A;&#x526F;&#x672C;&#x7684;&#x5DE5;&#x4F5C;&#x673A;&#x5D29;&#x6E83;&#xFF0C;&#x5219;&#x7BA1;&#x7406;&#x5668;&#x5C06;&#x521B;&#x5EFA;&#x4E24;&#x4E2A;&#x65B0;&#x526F;&#x672C;&#x6765;&#x66FF;&#x6362;&#x5D29;&#x6E83;&#x7684;&#x526F;&#x672C;&#x3002;&#x7FA4;&#x7BA1;&#x7406;&#x5668;&#x5C06;&#x65B0;&#x526F;&#x672C;&#x5206;&#x914D;&#x7ED9;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x4E14;&#x53EF;&#x7528;&#x7684;&#x5DE5;&#x4F5C;&#x7A0B;&#x5E8F;&#x3002;</li>
<li>&#x591A;&#x4E3B;&#x673A;&#x7F51;&#x7EDC;&#xFF1A;&#x60A8;&#x53EF;&#x4EE5;&#x4E3A;&#x670D;&#x52A1;&#x6307;&#x5B9A;&#x8986;&#x76D6;&#x7F51;&#x7EDC;&#x3002;&#x96C6;&#x7FA4;&#x7BA1;&#x7406;&#x5668;&#x5728;&#x521D;&#x59CB;&#x5316;&#x6216;&#x66F4;&#x65B0;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#x4F1A;&#x81EA;&#x52A8;&#x5C06;&#x5730;&#x5740;&#x5206;&#x914D;&#x7ED9;&#x8986;&#x76D6;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x5BB9;&#x5668;&#x3002;</li>
<li>&#x670D;&#x52A1;&#x53D1;&#x73B0;&#xFF1A;&#x7FA4;&#x96C6;&#x7BA1;&#x7406;&#x5668;&#x8282;&#x70B9;&#x4E3A;&#x7FA4;&#x96C6;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x5206;&#x914D;&#x552F;&#x4E00;&#x7684;DNS&#x540D;&#x79F0;&#xFF0C;&#x5E76;&#x5E73;&#x8861;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x5BB9;&#x5668;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7FA4;&#x96C6;&#x4E2D;&#x5D4C;&#x5165;&#x7684;DNS&#x670D;&#x52A1;&#x5668;&#x67E5;&#x8BE2;&#x7FA4;&#x96C6;&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x6BCF;&#x4E2A;&#x5BB9;&#x5668;&#x3002;</li>
<li>&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#xFF1A;&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x670D;&#x52A1;&#x7AEF;&#x53E3;&#x516C;&#x5F00;&#x7ED9;&#x5916;&#x90E8;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x5668;&#x3002;&#x5728;&#x5185;&#x90E8;&#xFF0C;&#x7FA4;&#x96C6;&#x53EF;&#x8BA9;&#x60A8;&#x6307;&#x5B9A;&#x5982;&#x4F55;&#x5728;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x5206;&#x914D;&#x670D;&#x52A1;&#x5BB9;&#x5668;&#x3002;</li>
<li>&#x9ED8;&#x8BA4;&#x4E3A;&#x5B89;&#x5168;&#xFF1A;&#x7FA4;&#x96C6;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x6267;&#x884C;TLS&#x76F8;&#x4E92;&#x8EAB;&#x4EFD;&#x9A8C;&#x8BC1;&#x548C;&#x52A0;&#x5BC6;&#xFF0C;&#x4EE5;&#x4FDD;&#x62A4;&#x81EA;&#x8EAB;&#x4E0E;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x5B89;&#x5168;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x4F7F;&#x7528;&#x81EA;&#x7B7E;&#x540D;&#x6839;&#x8BC1;&#x4E66;&#x6216;&#x6765;&#x81EA;&#x81EA;&#x5B9A;&#x4E49;&#x6839;CA&#x7684;&#x8BC1;&#x4E66;&#x3002;</li>
<li>&#x6EDA;&#x52A8;&#x66F4;&#x65B0;&#xFF1A;&#x5728;&#x63A8;&#x51FA;&#x65F6;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x670D;&#x52A1;&#x66F4;&#x65B0;&#x9010;&#x6B65;&#x5E94;&#x7528;&#x4E8E;&#x8282;&#x70B9;&#x3002;&#x7FA4;&#x7BA1;&#x7406;&#x5668;&#x4F7F;&#x60A8;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x5C06;&#x670D;&#x52A1;&#x90E8;&#x7F72;&#x5230;&#x4E0D;&#x540C;&#x8282;&#x70B9;&#x96C6;&#x4E4B;&#x95F4;&#x7684;&#x5EF6;&#x8FDF;&#x3002;&#x5982;&#x679C;&#x6709;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x56DE;&#x6EDA;&#x5230;&#x8BE5;&#x670D;&#x52A1;&#x7684;&#x5148;&#x524D;&#x7248;&#x672C;&#x3002;</li>
</ul>
<h5 id="&#x8282;&#x70B9;&#x6570;">&#x8282;&#x70B9;&#x6570;</h5>
<p>&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x662F;docker&#x5F15;&#x64CE;&#x53C2;&#x4E0E;&#x96C6;&#x7FA4;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x8981;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#x5230;&#x96C6;&#x7FA4;&#x4E2D;&#xFF0C;&#x9700;&#x8981;&#x5411;manager&#x8282;&#x70B9;&#x63D0;&#x4EA4;&#x670D;&#x52A1;&#x5B9A;&#x4E49;&#x3002;</p>
<ul>
<li><p>manager&#x8282;&#x70B9;:&#x5206;&#x914D;&#x4EFB;&#x52A1;&#x7ED9;&#x5DE5;&#x4F5C;&#x8282;&#x70B9;,&#x5728;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x7BA1;&#x7406;&#x5668;&#x8282;&#x70B9;&#x4E5F;&#x4F5C;&#x4E3A;&#x5DE5;&#x4F5C;&#x8282;&#x70B9;&#x8FD0;&#x884C;&#x670D;&#x52A1;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x914D;&#x7F6E;&#x4E3A;&#x4EE5;&#x72EC;&#x5360;&#x65B9;&#x5F0F;&#x8FD0;&#x884C;&#x7BA1;&#x7406;&#x5668;&#x4EFB;&#x52A1;</p>
</li>
<li><p>&#x5DE5;&#x4F5C;&#x8282;&#x70B9;:&#x5DE5;&#x4F5C;&#x8282;&#x70B9;&#x63A5;&#x6536;&#x5E76;&#x6267;&#x884C;&#x4ECE;&#x7BA1;&#x7406;&#x5668;&#x8282;&#x70B9;&#x5206;&#x6D3E;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;worker&#x8282;&#x70B9;&#x901A;&#x77E5;manager&#x8282;&#x70B9;&#x5176;&#x5DF2;&#x5206;&#x914D;&#x4EFB;&#x52A1;&#x7684;&#x5F53;&#x524D;&#x72B6;&#x6001;&#xFF0C;&#x4EE5;&#x4FBF;manager&#x53EF;&#x4EE5;&#x4FDD;&#x6301;&#x6BCF;&#x4E2A;worker&#x7684;&#x6240;&#x9700;&#x72B6;&#x6001;&#x3002;</p>
</li>
</ul>
<h5 id="&#x670D;&#x52A1;">&#x670D;&#x52A1;</h5>
<p>&#x670D;&#x52A1;&#x662F;&#x5728;<code>&#x7BA1;&#x7406;&#x5668;</code>&#x6216;<code>&#x5DE5;&#x4F5C;&#x8282;&#x70B9;</code>&#x4E0A;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x5B83;&#x662F;&#x7FA4;&#x7CFB;&#x7EDF;&#x7684;&#x6838;&#x5FC3;&#x7ED3;&#x6784;&#xFF0C;&#x662F;&#x7528;&#x6237;&#x4E0E;&#x7FA4;&#x4EA4;&#x4E92;</p>
<ul>
<li>&#x5728;<code>&#x590D;&#x5236;&#x670D;&#x52A1;&#x6A21;&#x578B;&#x4E2D;</code>:&#x7BA1;&#x7406;&#x5668;&#x6839;&#x636E;&#x8BBE;&#x7F6E;&#x89C4;&#x6A21;&#x5728;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x5206;&#x914D;&#x7279;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x590D;&#x5236;&#x4EFB;&#x52A1;</li>
<li>&#x5728;<code>&#x5168;&#x5C40;&#x6A21;&#x578B;</code>:&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x53EF;&#x7528;&#x8282;&#x70B9;&#x4E0A;&#x4E3A;&#x670D;&#x52A1;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;</li>
</ul>
<h6 id="&#x8D1F;&#x8F7D;&#x5747;&#x8861;">&#x8D1F;&#x8F7D;&#x5747;&#x8861;</h6>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="rong-qi-kai-ji-zi-dong-qi-dong/dockerfile.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: dockerfile">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"集群模式","level":"1.8","depth":1,"previous":{"title":"dockerfile","level":"1.7.11","depth":2,"path":"rong-qi-kai-ji-zi-dong-qi-dong/dockerfile.md","ref":"rong-qi-kai-ji-zi-dong-qi-dong/dockerfile.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"swarm.md","mtime":"2019-12-16T02:43:13.644Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-12-16T08:42:54.167Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

