
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>图-Graph · designpatterns</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="baihui">
        
        
    
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-mermaid-gb3/mermaid/mermaid.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-alerts/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-terminal/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism-tomorrow.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    


    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="lian-biao.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    First Chapter
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="hash.html">
            
                <a href="hash.html">
            
                    
                    Hash
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="san-lie-suan-fa.html">
            
                <a href="san-lie-suan-fa.html">
            
                    
                    散列算法
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="san-lie-suan-fa/dan-xiang-san-lie-suan-fa.html">
            
                <a href="san-lie-suan-fa/dan-xiang-san-lie-suan-fa.html">
            
                    
                    单向散列算法
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="shu-ju-jie-gou.html">
            
                <a href="shu-ju-jie-gou.html">
            
                    
                    数据结构
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="shu-ju-jie-gou/san-lie.html">
            
                <a href="shu-ju-jie-gou/san-lie.html">
            
                    
                    散列
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="lian-biao.html">
            
                <a href="lian-biao.html">
            
                    
                    链表
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="tu-ff08-graph.html">
            
                <a href="tu-ff08-graph.html">
            
                    
                    图-Graph
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >图-Graph</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p><strong>&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x56FE;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x50CF;&#x4E0B;&#x56FE;&#x8FD9;&#x6837;&#xFF1A;</strong><br><img src="assets/4064751-9ef7887aca675269.png" alt=""></p>
<p>&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E2D; &#x4E00;&#x4E2A;&#x56FE;&#x5C31;&#x662F;&#x4E00;&#x4E9B;&#x9876;&#x70B9;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x8FD9;&#x4E9B;&#x9876;&#x70B9;&#x901A;&#x8FC7;&#x4E00;&#x7CFB;&#x5217;&#x8FB9;&#x7ED3;&#x5BF9;&#xFF08;&#x8FDE;&#x63A5;&#xFF09;&#x3002;&#x9876;&#x70B9;&#x7528;&#x5706;&#x5708;&#x8868;&#x793A;&#xFF0C;&#x8FB9;&#x5C31;&#x662F;&#x8FD9;&#x4E9B;&#x5706;&#x5708;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x7EBF;&#x3002;&#x9876;&#x70B9;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x8FB9;&#x8FDE;&#x63A5;&#x3002;</p>
<blockquote>
<p>&#x9876;&#x70B9;&#x6570;&#x636E;&#xFF0C;&#x5750;&#x6807;&#xFF0C;&#x9876;&#x70B9;&#x6709;&#x65F6;&#x4E5F;&#x79F0;&#x4E3A;&#x8282;&#x70B9;&#x6216;&#x8005;&#x4EA4;&#x70B9;&#xFF0C;&#x8FB9;&#x6709;&#x65F6;&#x4E5F;&#x79F0;&#x4E3A;&#x94FE;&#x63A5;</p>
</blockquote>
<p>&#x4E00;&#x4E2A;&#x56FE;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x4EBA;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#xFF0C;&#x4E92;&#x76F8;&#x8BA4;&#x8BC6;&#x7684;&#x4EBA;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x8FB9;&#x8054;&#x7CFB;</p>
<p><img src="assets/4064751-98d670ae394f3695.png" alt=""></p>
<p>&#x56FE;&#x6709;&#x5404;&#x79CD;&#x5F62;&#x72B6;&#x548C;&#x5927;&#x5C0F;&#x3002;&#x8FB9;&#x53EF;&#x4EE5;&#x6709;&#x6743;&#x91CD;&#xFF08;weight&#xFF09;&#xFF0C;&#x5373;&#x6BCF;&#x4E00;&#x6761;&#x8FB9;&#x4F1A;&#x88AB;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x6B63;&#x6570;&#x6216;&#x8005;&#x8D1F;&#x6570;&#x503C;&#x3002;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x4EE3;&#x8868;&#x822A;&#x7EBF;&#x7684;&#x56FE;&#x3002;&#x5404;&#x4E2A;&#x57CE;&#x5E02;&#x5C31;&#x662F;&#x9876;&#x70B9;&#xFF0C;&#x822A;&#x7EBF;&#x5C31;&#x662F;&#x8FB9;&#x3002;&#x90A3;&#x4E48;&#x8FB9;&#x7684;&#x6743;&#x91CD;&#x53EF;&#x4EE5;&#x662F;&#x98DE;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x6216;&#x8005;&#x673A;&#x7968;&#x4EF7;&#x683C;</p>
<p><img src="assets/4064751-7d75da02d729e64c.png" alt=""></p>
<p>&#x6709;&#x4E86;&#x8FD9;&#x6837;&#x4E00;&#x5F20;&#x5047;&#x8BBE;&#x7684;&#x822A;&#x7EBF;&#x56FE;&#x3002;&#x4ECE;&#x65E7;&#x91D1;&#x5C71;&#x5230;&#x83AB;&#x65AF;&#x79D1;&#x6700;&#x4FBF;&#x5B9C;&#x7684;&#x8DEF;&#x7EBF;&#x662F;&#x5230;&#x7EBD;&#x7EA6;&#x8F6C;&#x673A;&#x3002;</p>
<p>&#x8FB9;&#x53EF;&#x4EE5;&#x662F;&#x6709;&#x65B9;&#x5411;&#x7684;&#x3002;&#x5728;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x8FB9;&#x662F;&#x6CA1;&#x6709;&#x65B9;&#x5411;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C; Ada &#x8BA4;&#x8BC6; Charles&#xFF0C;&#x90A3;&#x4E48; Charles &#x4E5F;&#x5C31;&#x8BA4;&#x8BC6; Ada&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x6709;&#x65B9;&#x5411;&#x7684;&#x8FB9;&#x610F;&#x5473;&#x7740;&#x662F;&#x5355;&#x65B9;&#x9762;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x4E00;&#x6761;&#x4ECE;&#x9876;&#x70B9; X &#x5230; &#x9876;&#x70B9; Y &#x7684;&#x8FB9;&#x662F;&#x5C06; X &#x8054;&#x5411; Y&#xFF0C;&#x4E0D;&#x662F;&#x5C06; Y &#x8054;&#x5411; X&#x3002;</p>
<p>&#x7EE7;&#x7EED;&#x524D;&#x9762;&#x822A;&#x73ED;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4ECE;&#x65E7;&#x91D1;&#x5C71;&#x5230;&#x963F;&#x62C9;&#x65AF;&#x52A0;&#x7684;&#x6731;&#x8BFA;&#x6709;&#x5411;&#x8FB9;&#x610F;&#x5473;&#x7740;&#x4ECE;&#x65E7;&#x91D1;&#x5C71;&#x5230;&#x6731;&#x8BFA;&#x6709;&#x822A;&#x73ED;&#xFF0C;&#x4F46;&#x662F;&#x4ECE;&#x6731;&#x8BFA;&#x5230;&#x65E7;&#x91D1;&#x5C71;&#x6CA1;&#x6709;&#xFF08;&#x6211;&#x5047;&#x8BBE;&#x90A3;&#x6837;&#x610F;&#x5473;&#x7740;&#x4F60;&#x9700;&#x8981;&#x8D70;&#x56DE;&#x53BB;&#xFF09;&#x3002;</p>
<p><img src="assets/4064751-c9ece5586fa955f8.png" alt=""></p>
<ul>
<li><strong>&#x4E0B;&#x9762;&#x7684;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E5F;&#x662F;&#x5C5E;&#x4E8E;&#x56FE;&#xFF1A;</strong></li>
</ul>
<p><img src="assets/4064751-0f7469ff0be704de.png" alt=""></p>
<p>&#x5DE6;&#x8FB9;&#x7684;&#x662F;&#x6811;&#xFF0C;&#x53F3;&#x8FB9;&#x7684;&#x662F;&#x94FE;&#x8868;&#x3002;&#x4ED6;&#x4EEC;&#x90FD;&#x53EF;&#x4EE5;&#x88AB;&#x5F53;&#x6210;&#x662F;&#x6811;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x4E00;&#x79CD;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x5F62;&#x5F0F;&#x3002;&#x4ED6;&#x4EEC;&#x90FD;&#x6709;&#x9876;&#x70B9;&#xFF08;&#x8282;&#x70B9;&#xFF09;&#x548C;&#x8FB9;&#xFF08;&#x8FDE;&#x63A5;&#xFF09;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x79CD;&#x56FE;&#x5305;&#x542B;&#x5708;&#xFF08;cycles&#xFF09;&#xFF0C;&#x5373;&#x4F60;&#x53EF;&#x4EE5;&#x4ECE;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x51FA;&#x53D1;&#xFF0C;&#x6CBF;&#x7740;&#x4E00;&#x6761;&#x8DEF;&#x52B2;&#x6700;&#x7EC8;&#x4F1A;&#x56DE;&#x5230;&#x6700;&#x521D;&#x7684;&#x9876;&#x70B9;&#x3002;&#x6811;&#x662F;&#x4E0D;&#x5305;&#x542B;<strong>&#x5708;</strong>&#x7684;&#x56FE;&#x3002;</p>
<ul>
<li><strong>&#x53E6;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x56FE;&#x7C7B;&#x578B;&#x662F;&#x5355;&#x5411;&#x56FE;&#x6216;&#x8005; DAG</strong></li>
</ul>
<p><img src="assets/4064751-af16c3d5a506e610.png" alt=""></p>
<p>&#x5C31;&#x50CF;&#x6811;&#x4E00;&#x6837;&#xFF0C;<strong>&#x8FD9;&#x4E2A;&#x56FE;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5708;</strong>&#xFF08;&#x65E0;&#x8BBA;&#x4F60;&#x4ECE;&#x54EA;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x51FA;&#x53D1;&#xFF0C;&#x4F60;&#x90FD;&#x65E0;&#x6CD5;&#x56DE;&#x5230;&#x6700;&#x521D;&#x7684;&#x8282;&#x70B9;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x56FE;&#x6709;&#x6709;&#x5411;&#x8FB9;&#xFF08;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7BAD;&#x5934;&#x8868;&#x793A;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x7BAD;&#x5934;&#x4E0D;&#x8868;&#x793A;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#xFF09;&#x3002;</p>
<ul>
<li><strong>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x4F7F;&#x7528;&#x56FE;&#xFF1F;</strong></li>
</ul>
<p>&#x56FE;&#x662F;&#x4E00;&#x79CD;&#x6709;&#x7528;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x4E00;&#x4E9B;&#x7F16;&#x7A0B;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9876;&#x70B9;&#x548C;&#x8FB9;&#x8868;&#x793A;&#x51FA;&#x6765;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x4F60;&#x7684;&#x95EE;&#x9898;&#x7528;&#x56FE;&#x753B;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x8457;&#x540D;&#x7684;&#x56FE;&#x7B97;&#x6CD5;&#xFF08;&#x6BD4;&#x5982;<strong>&#x5E7F;&#x5EA6;&#x4F18;&#x5148;&#x641C;&#x7D22;</strong> &#x6216;&#x8005; <strong>&#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x641C;&#x7D22;</strong>&#xFF09;&#x6765;&#x627E;&#x5230;&#x89E3;&#x51B3;&#x65B9;&#x6848;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x6709;&#x4E00;&#x7CFB;&#x5217;&#x4EFB;&#x52A1;&#x9700;&#x8981;&#x5B8C;&#x6210;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x7684;&#x4EFB;&#x52A1;&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x540E;&#x624D;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x975E;&#x5FAA;&#x73AF;&#x6709;&#x5411;&#x56FE;&#x6765;&#x5EFA;&#x7ACB;&#x6A21;&#x578B;&#xFF1A;</p>
<p><img src="assets/4064751-afa3948a9e805a67.png" alt=""></p>
<p>&#x6BCF;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x4E24;&#x4E2A;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x8FB9;&#x8868;&#x793A;&#x76EE;&#x7684;&#x4EFB;&#x52A1;&#x5FC5;&#x987B;&#x7B49;&#x5230;&#x6E90;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x540E;&#x624D;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5728;&#x4EFB;&#x52A1;B&#x548C;&#x4EFB;&#x52A1;D&#x90FD;&#x5B8C;&#x6210;&#x4E4B;&#x524D;&#xFF0C;&#x4EFB;&#x52A1;C&#x4E0D;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x3002;&#x5728;&#x4EFB;&#x52A1;A&#x5B8C;&#x6210;&#x4E4B;&#x524D;&#xFF0C;&#x4EFB;&#x52A1;A&#x548C;D&#x90FD;&#x4E0D;&#x80FD;&#x5F00;&#x59CB;&#x3002;</p>
<blockquote>
<p>&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x901A;&#x8FC7;&#x56FE;&#x63CF;&#x8FF0;&#x6E05;&#x695A;&#x4E86;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x641C;&#x7D22;&#x7B97;&#x6CD5;&#x6765;&#x6267;&#x884C;&#x6267;&#x884C;&#x62D3;&#x6251;&#x6392;&#x5E8F;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x6240;&#x6709;&#x7684;&#x4EFB;&#x52A1;&#x6392;&#x5165;&#x6700;&#x4F18;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;&#xFF0C;&#x4FDD;&#x8BC1;&#x7B49;&#x5F85;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x7684;&#x65F6;&#x95F4;&#x6700;&#x5C0F;&#x5316;&#x3002;&#xFF08;&#x8FD9;&#x91CC;&#x53EF;&#x80FD;&#x7684;&#x987A;&#x5E8F;&#x4E4B;&#x4E00;&#x662F;&#xFF1A;A, B, D, E, C, F, G, H, I, J, K&#xFF09;</p>
</blockquote>
<p><strong>&#x4E0D;&#x7BA1;&#x662F;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x9047;&#x5230;&#x56F0;&#x96BE;&#x7684;&#x7F16;&#x7A0B;&#x95EE;&#x9898;&#xFF0C;&#x95EE;&#x4E00;&#x95EE;&#x81EA;&#x5DF1;&#xFF1A;&#x201C;&#x5982;&#x4F55;&#x7528;&#x56FE;&#x6765;&#x8868;&#x8FF0;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF1F;&#x201D;&#x3002;&#x56FE;&#x90FD;&#x662F;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x6570;&#x636E;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002; &#x8BC0;&#x7A8D;&#x5728;&#x4E8E;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x201C;&#x5173;&#x7CFB;&#x201D;&#x3002;</strong></p>
<p>&#x5982;&#x679C;&#x4F60;&#x662F;&#x4E00;&#x4E2A;&#x97F3;&#x4E50;&#x5BB6;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x559C;&#x6B22;&#x8FD9;&#x4E2A;&#x56FE;&#xFF1A;<br><img src="assets/4064751-7d135e1e7e5dd566.png" alt=""></p>
<p>&#x8FD9;&#x4E9B;&#x9876;&#x70B9;&#x6765;&#x81EA;C&#x5927;&#x8C03;&#x7684;&#x548C;&#x5F26;&#x3002;&#x8FD9;&#x4E9B;&#x8FB9;--&#x8868;&#x793A;&#x548C;&#x5F26;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;--&#x63CF;&#x8FF0;&#x4E86;&#x600E;&#x6837;&#x4ECE;&#x4E00;&#x4E2A;&#x548C;&#x5F26;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x548C;&#x5F26;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x5411;&#x56FE;&#xFF0C;&#x6240;&#x4EE5;&#x7BAD;&#x5934;&#x7684;&#x65B9;&#x5411;&#x8868;&#x793A;&#x4E86;&#x600E;&#x6837;&#x4ECE;&#x4E00;&#x4E2A;&#x548C;&#x5F26;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x548C;&#x5F26;&#x3002;&#x5B83;&#x540C;&#x65F6;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x52A0;&#x6743;&#x56FE;&#xFF0C;&#x6BCF;&#x4E00;&#x6761;&#x8FB9;&#x7684;&#x6743;&#x91CD;&#xFF08;&#x8FD9;&#x91CC;&#x7528;&#x7EBF;&#x6761;&#x7684;&#x5BBD;&#x5EA6;&#x6765;&#x8868;&#x793A;&#xFF09;&#x8BF4;&#x660E;&#x4E86;&#x4E24;&#x4E2A;&#x548C;&#x5F26;&#x4E4B;&#x95F4;&#x7684;&#x5F3A;&#x5F31;&#x5173;&#x7CFB;&#x3002;&#x5982;&#x4F60;&#x6240;&#x89C1;&#xFF0C;G7-&#x548C;&#x5F26;&#x540E;&#x662F;&#x4E00;&#x4E2A;C&#x548C;&#x5F26;&#x548C;&#x4E00;&#x4E2A;&#x5F88;&#x8F7B;&#x7684; Am &#x548C;&#x5F26;&#x3002;</p>
<p>&#x7A0B;&#x5E8F;&#x5458;&#x5E38;&#x7528;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x56FE;&#x5C31;&#x662F;&#x72B6;&#x6001;&#x673A;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x8FB9;&#x63CF;&#x8FF0;&#x4E86;&#x72B6;&#x6001;&#x4E4B;&#x95F4;&#x5207;&#x6362;&#x7684;&#x6761;&#x4EF6;&#x3002;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#x673A;&#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x4E2A;&#x732B;&#x7684;&#x72B6;&#x6001;&#xFF1A;</p>
<p><img src="assets/4064751-8f5334960c871d0b.png" alt=""></p>
<p>&#x56FE;&#x771F;&#x7684;&#x5F88;&#x68D2;&#x3002;Facebook &#x5C31;&#x4ECE;&#x4ED6;&#x4EEC;&#x7684;&#x793E;&#x4EA4;&#x56FE;&#x4E2D;&#x8D5A;&#x53D6;&#x4E86;&#x5DE8;&#x989D;&#x8D22;&#x5BCC;&#x3002;&#x5982;&#x679C;&#x8BA1;&#x5212;&#x5B66;&#x4E60;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5219;&#x5E94;&#x8BE5;&#x9009;&#x62E9;&#x56FE;&#xFF0C;&#x4EE5;&#x53CA;&#x5927;&#x91CF;&#x7684;&#x6807;&#x51C6;&#x56FE;&#x7B97;&#x6CD5;&#x3002;</p>
<p><strong>&#x9876;&#x70B9;&#x548C;&#x8FB9;</strong><br>&#x7406;&#x8BBA;&#x4E0A;&#xFF0C;&#x56FE;&#x5C31;&#x662F;&#x4E00;&#x5806;&#x9876;&#x70B9;&#x548C;&#x8FB9;&#x5BF9;&#x8C61;&#x800C;&#x5DF2;&#xFF0C;&#x4F46;&#x662F;&#x600E;&#x4E48;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x6765;&#x63CF;&#x8FF0;&#x5462;&#xFF1F;&#x6709;&#x4E24;&#x79CD;&#x4E3B;&#x8981;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;<strong>&#x90BB;&#x63A5;&#x5217;&#x8868;&#x548C;&#x90BB;&#x63A5;&#x77E9;&#x9635;&#x3002;</strong></p>
<ul>
<li><p><strong>&#x90BB;&#x63A5;&#x5217;&#x8868;</strong><br> &#x5728;&#x90BB;&#x63A5;&#x5217;&#x8868;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x4F1A;&#x5B58;&#x50A8;&#x4E00;&#x4E2A;&#x4ECE;&#x5B83;&#x8FD9;&#x91CC;&#x5F00;&#x59CB;&#x7684;&#x8FB9;&#x7684;&#x5217;&#x8868;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x9876;&#x70B9;A &#x6709;&#x4E00;&#x6761;&#x8FB9;&#x5230;B&#x3001;C&#x548C;D&#xFF0C;&#x90A3;&#x4E48;A&#x7684;&#x5217;&#x8868;&#x4E2D;&#x4F1A;&#x6709;3&#x6761;&#x8FB9;</p>
<p><img src="assets/4064751-38001183923906c6.png" alt=""><br>&#x90BB;&#x63A5;&#x5217;&#x8868;&#x53EA;&#x63CF;&#x8FF0;&#x4E86;&#x6307;&#x5411;&#x5916;&#x90E8;&#x7684;&#x8FB9;&#x3002;A &#x6709;&#x4E00;&#x6761;&#x8FB9;&#x5230;B&#xFF0C;&#x4F46;&#x662F;B&#x6CA1;&#x6709;&#x8FB9;&#x5230;A&#xFF0C;&#x6240;&#x4EE5; A&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x5728;B&#x7684;&#x90BB;&#x63A5;&#x5217;&#x8868;&#x4E2D;&#x3002;&#x67E5;&#x627E;&#x4E24;&#x4E2A;&#x9876;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x8FB9;&#x6216;&#x8005;&#x6743;&#x91CD;&#x4F1A;&#x6BD4;&#x8F83;&#x8D39;&#x65F6;&#xFF0C;&#x56E0;&#x4E3A;&#x904D;&#x5386;&#x90BB;&#x63A5;&#x5217;&#x8868;&#x76F4;&#x5230;&#x627E;&#x5230;&#x4E3A;&#x6B62;&#x3002;</p>
</li>
<li><p><strong>&#x90BB;&#x63A5;&#x77E9;&#x9635;</strong> &#x5728;&#x90BB;&#x63A5;&#x77E9;&#x9635;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x7531;&#x884C;&#x548C;&#x5217;&#x90FD;&#x8868;&#x793A;&#x9876;&#x70B9;&#xFF0C;&#x7531;&#x4E24;&#x4E2A;&#x9876;&#x70B9;&#x6240;&#x51B3;&#x5B9A;&#x7684;&#x77E9;&#x9635;&#x5BF9;&#x5E94;&#x5143;&#x7D20;&#x8868;&#x793A;&#x8FD9;&#x91CC;&#x4E24;&#x4E2A;&#x9876;&#x70B9;&#x662F;&#x5426;&#x76F8;&#x8FDE;&#x3001;&#x5982;&#x679C;&#x76F8;&#x8FDE;&#x8FD9;&#x4E2A;&#x503C;&#x8868;&#x793A;&#x7684;&#x662F;&#x76F8;&#x8FDE;&#x8FB9;&#x7684;&#x6743;&#x91CD;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4ECE;&#x9876;&#x70B9;A&#x5230;&#x9876;&#x70B9;B&#x6709;&#x4E00;&#x6761;&#x6743;&#x91CD;&#x4E3A; 5.6 &#x7684;&#x8FB9;&#xFF0C;&#x90A3;&#x4E48;&#x77E9;&#x9635;&#x4E2D;&#x7B2C;A&#x884C;&#x7B2C;B&#x5217;&#x7684;&#x4F4D;&#x7F6E;&#x7684;&#x5143;&#x7D20;&#x503C;&#x5E94;&#x8BE5;&#x662F;5.6&#xFF1A;</p>
</li>
</ul>
<p><img src="assets/4064751-c18cf94561b1dc0c.png" alt=""></p>
<p>&#x5F80;&#x8FD9;&#x4E2A;&#x56FE;&#x4E2D;&#x6DFB;&#x52A0;&#x9876;&#x70B9;&#x7684;&#x6210;&#x672C;&#x975E;&#x5E38;&#x6602;&#x8D35;&#xFF0C;&#x56E0;&#x4E3A;&#x65B0;&#x7684;&#x77E9;&#x9635;&#x7ED3;&#x679C;&#x5FC5;&#x987B;&#x91CD;&#x65B0;&#x6309;&#x7167;&#x65B0;&#x7684;&#x884C;/&#x5217;&#x521B;&#x5EFA;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5DF2;&#x6709;&#x7684;&#x6570;&#x636E;&#x590D;&#x5236;&#x5230;&#x65B0;&#x7684;&#x77E9;&#x9635;&#x4E2D;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x4F7F;&#x7528;&#x54EA;&#x4E00;&#x4E2A;&#x5462;&#xFF1F;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#xFF0C;&#x9009;&#x62E9;&#x90BB;&#x63A5;&#x5217;&#x8868;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x4E24;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x6BD4;&#x8F83;&#x3002;</p>
<p>&#x5047;&#x8BBE; V &#x8868;&#x793A;&#x56FE;&#x4E2D;&#x9876;&#x70B9;&#x7684;&#x4E2A;&#x6570;&#xFF0C;E &#x8868;&#x793A;&#x8FB9;&#x7684;&#x4E2A;&#x6570;&#x3002;</p>
<table>
<thead>
<tr>
<th style="text-align:left">&#x64CD;&#x4F5C;</th>
<th style="text-align:left">&#x90BB;&#x63A5;&#x5217;&#x8868;</th>
<th style="text-align:left">&#x90BB;&#x63A5;&#x77E9;&#x9635;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left">&#x5B58;&#x50A8;&#x7A7A;&#x95F4;</td>
<td style="text-align:left">O(V + E)</td>
<td style="text-align:left">O(V^2)</td>
</tr>
<tr>
<td style="text-align:left">&#x6DFB;&#x52A0;&#x9876;&#x70B9;</td>
<td style="text-align:left">O(1)</td>
<td style="text-align:left">O(V^2)</td>
</tr>
<tr>
<td style="text-align:left">&#x6DFB;&#x52A0;&#x8FB9;</td>
<td style="text-align:left">O(1)</td>
<td style="text-align:left">O(1)</td>
</tr>
<tr>
<td style="text-align:left">&#x68C0;&#x67E5;&#x76F8;&#x90BB;&#x6027;</td>
<td style="text-align:left">O(V)</td>
<td style="text-align:left">O(1)</td>
</tr>
</tbody>
</table>
<blockquote>
<p>&#x68C0;&#x67E5;&#x76F8;&#x90BB;&#x6027;&#x662F;&#x6307;&#x5BF9;&#x4E8E;&#x7ED9;&#x5B9A;&#x7684;&#x9876;&#x70B9;&#xFF0C;&#x5C1D;&#x8BD5;&#x786E;&#x5B9A;&#x5B83;&#x662F;&#x5426;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x7684;&#x90BB;&#x5C45;&#x3002;&#x5728;&#x90BB;&#x63A5;&#x5217;&#x8868;&#x4E2D;&#x68C0;&#x67E5;&#x76F8;&#x90BB;&#x6027;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x662F;O(V)&#xFF0C;&#x56E0;&#x4E3A;&#x6700;&#x574F;&#x7684;&#x60C5;&#x51B5;&#x662F;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x4E0E;&#x6BCF;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x90FD;&#x76F8;&#x8FDE;&#x3002;</p>
</blockquote>
<p>&#x5728; &#x7A00;&#x758F;&#x56FE;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x90FD;&#x53EA;&#x4F1A;&#x548C;&#x5C11;&#x6570;&#x51E0;&#x4E2A;&#x9876;&#x70B9;&#x76F8;&#x8FDE;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x76F8;&#x90BB;&#x5217;&#x8868;&#x662F;&#x6700;&#x4F73;&#x9009;&#x62E9;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x56FE;&#x6BD4;&#x8F83;&#x5BC6;&#x96C6;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x90FD;&#x548C;&#x5927;&#x591A;&#x6570;&#x5176;&#x4ED6;&#x9876;&#x70B9;&#x76F8;&#x8FDE;&#xFF0C;&#x90A3;&#x4E48;&#x76F8;&#x90BB;&#x77E9;&#x9635;&#x66F4;&#x5408;&#x9002;&#x3002;</p>
<p><a href="https://www.jianshu.com/p/bce71b2bdbc8" target="_blank">https://www.jianshu.com/p/bce71b2bdbc8</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="lian-biao.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 链表">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"图-Graph","level":"1.7","depth":1,"previous":{"title":"链表","level":"1.6","depth":1,"path":"lian-biao.md","ref":"lian-biao.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","mermaid-gb3","splitter","alerts","puml","-search","search-pro","terminal","splitter","expandable-chapters","-highlight","prism","prism-themes","fontsettings"],"styles":{"website":"styles/website.css","ebook":"styles/ebook.css","pdf":"styles/pdf.css","mobi":"styles/mobi.css","epub":"styles/epub.css"},"pluginsConfig":{"prism":{"css":["prismjs/themes/prism-tomorrow.css"]},"github":{"url":"https://github.com/baihui"},"puml":{},"splitter":{},"search-pro":{"cutWordLib":"nodejieba","defineWord":["Gitbook Use"]},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"family":"sans","size":2,"theme":"white"},"mermaid-gb3":{},"prism-themes":{},"alerts":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"terminal":{"copyButtons":true,"fade":true,"style":"flat"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{}},"theme":"default","author":"baihui","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"designpatterns","language":"zh-hans","gitbook":"*","description":"一切皆为文件"},"file":{"path":"tu-ff08-graph.md","mtime":"2019-10-26T22:38:06.734Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-11-11T02:02:26.852Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-mermaid-gb3/book/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-alerts/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-terminal/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    

    <script src="gitbook/gitbook-plugin-mermaid-gb3/mermaid/mermaid.min.js"></script>

    </body>
</html>

